# Напишите функцию которая находит самое длинное слово в строке.

str = "python java c c++ javascript pascal php"
print(str)

listWords = str.split()

idLongestWord = 0

for i in range(1,len(listWords)):
    if len(listWords[idLongestWord]) < len(listWords[i]):
        idLongestWord = i

print(listWords[idLongestWord])